source/Tooling/post-migration/eubt-sans-maven/eu.artist.postmigration.eubt.prototype/requests/original/getPetCategory.xml

<?xml version='1.0' encoding='utf-8'?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <web:getPetCategory xmlns:web="http://webservices.artist.eu/">
      <categoryid>1</categoryid>
    </web:getPetCategory>
  </soapenv:Body>
</soapenv:Envelope>