source/Tooling/post-migration/eubt/eu.artist.postmigration.eubt.prototype/requests/migrated/obtainUser_unequal.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservices.artist.eu/">
   <soapenv:Header/>
   <soapenv:Body>
      <web:obtainUser>
         <uid>1</uid>
      </web:obtainUser>
   </soapenv:Body>
</soapenv:Envelope>